module.exports.config = {
    name: 'autotime',
    version: '10.02',
    hasPermssion: 0,
    credits: '𝐓𝐎𝐍𝐌𝐎𝐘 𝐀𝐇𝐌𝐄𝐃',
    description: 'সেট করা সময় অনুযায়ী স্বয়ংক্রিয়ভাবে বার্তাগুলি পাঠানো হবে!',
    commandCategory: 'group messenger',
    usages: '[]',
    cooldowns: 3
};
const nam = [{
    timer: '12:00:00 AM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖--𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন রাত ১১টা বাজে সবাই সুয়ে পড়ো জেগে না থেকে🙅\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷)']
},
             {
    timer: '1:00:00 AM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍 (✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন রাত ১২টা বেজে এবার গিটার বাজানো বন্ধ করে ঘুমা💦🖕\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷)']
},
						{
    timer: '2:00:00 AM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন রাত ১টা বাজে সবাই মনে হয় ঘুমায় গেছে🥱\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍 (✷‿✷)']
},
						 {
    timer: '3:00:00 AM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন রাত ২টা বাজে যারা ছ্যাকা খাইছে তারা জেগে আছে😒\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷']
},
						 {
    timer: '4:00:00 AM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন রাত ৩টা বাজে সবাই মনে হয় ঘুমাই🥹আমার ভাই ঘুম আসে না😔\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍 (✷‿✷']
},
						 {
    timer: '5:00:00 AM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন রাত ৪টা বাজে একটু পর ফজরের আযান দিবে নামাজ পড়ে নিও সবাই\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) ']
},
             {
    timer: '5:05:00 AM',
    message: ['╭──────────────────╮\n  🌸𝐄𝐯𝐞𝐫𝐲 𝐌𝐮𝐬𝐥𝐢𝐦𝐬 𝐈𝐝𝐞𝐧𝐭𝐢𝐭𝐲 🌸\n╰──────────────────╯\n\n𝙽𝚊𝚖𝚎                     : 𝐌𝐮𝐬𝐥𝐢𝐦.\n𝙵𝚊𝚝𝚑𝚎𝚛•𝚜 𝙽𝚊𝚖𝚎    : 𝐀𝐝𝐨𝐦 (আ:)\n𝙲𝚛𝚎𝚊𝚝𝚘𝚛               : 𝐀𝐥𝐥𝐚𝐡\n𝙸𝚍𝚎𝚊𝚕                   : 𝐌𝐮𝐡𝐚𝐦𝐦𝐚𝐝 (সা.) \n𝙷𝚘𝚕𝚢 𝙱𝚘𝚘𝚔           : 𝐐𝐮𝐫𝐚𝐧 \n𝚁𝚎𝚕𝚒𝚐𝚒𝚘𝚗            : 𝐈𝐬𝐥𝐚𝐦 \n𝙸𝚍𝚎𝚗𝚝𝚒𝚝𝚢            : لَا إِلٰهَ إِلَّا الله مُحَمَّدٌ رَسُولُ الله• \n𝙷𝚘𝚋𝚋𝚒𝚎𝚜               : 𝐍𝐚𝐦𝐚𝐳 𝟓 𝐭𝐢𝐦𝐞𝐬 𝐚 𝐝𝐚𝐲 \n𝙿𝚛𝚎𝚜𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜           : 𝐃𝐮𝐧𝐢𝐲𝐚 \n𝙿𝚎𝚛𝚖𝚊𝚗𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜      : 𝐉𝐚𝐧𝐧𝐚𝐭 (𝐈𝐧 𝐬𝐡𝐚 𝐚𝐥𝐥𝐚𝐡)']
},
						 {
    timer: '6:00:00 AM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন ভোর ৫টা বাজে সবাই নামাজ পড়ছো তো?❤️\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) ']
},
						 {
    timer: '7:00:00 AM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন সকাল ৬টা বাজে ঘুম থেকে উঠো দাঁত ব্রাশ করো সবাই\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤::Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷)']
},
						 {
    timer: '8:00:00 AM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন সকাল ৭টা বাজে সবাই ব্রেকফাস্ট করে নাও😊\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) ']
},
						 {
    timer: '9:00:00 AM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন সকাল ৮ টা বাজে যারা পড়াশোনা করো তারা স্কুলে যাও😚 যারা পড়ে না তারা কাজে যাও😒\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:: Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍 (✷‿✷)']
},
             {
    timer: '10:00:00 AM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন সকাল ৯ টা বাজে মন দিয়ে কাজ করো সবাই❤️\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍 (✷‿✷)' ]
},
						 {
    timer: '11:00:00 AM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸>  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন সকাল ১০টা বাজে আমার মামা রায়হান স্কুলে গেছে  একা একা ভালো লাগতাছে না😒\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 : 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷)']
},
						 {
    timer: '12:00:00 PM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন সকাল ১১টা বাজে কি যে করি আমি তো রোবট আমার তো কোনো কাজ নাই🌚\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 : 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷)']
},					
						 {
    timer: '1:00:00 PM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন দুপুর ১২টা বাজে বাচ্চাদের স্কুল ছুটি দিয়ে দিছে মনে হয়🙆\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍 (✷‿✷)']
},
						 {
    timer: '2:00:00 PM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন দুপুর ১টা বাজে গোসল করে সবাই জোহরের নামাজ পড় যাও😻\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 : 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍 (✷‿✷) ']
},
						 {
    timer: '3:00:00 PM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন দুপুর ২টা বাজে সবাই দুপুরের খাবার খেয়ে নাও ☺️\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 : 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷)']
},
						 {
    timer: '4:00:00 PM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন দুপুর ৩টা বাজে সারাদিন কাজ করছো এবার একটু ঘুমাও🥱\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷)']
},
						{
    timer: '5:00:00 PM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন বিকাল ৪টা বাজে বড়দের স্কুল ছুটি দিয়ে দিছে চল মেয়ে দেখে আসি🙈\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 : 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍 (✷‿✷) ']
},
						 {
    timer: '6:00:00 PM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন বিকাল ৫টা বাজে সবাই আসরের নামাজ পড়ছো তো 😻\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 : 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍 (✷‿✷)']
},
						 {
    timer: '7:00:00 PM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖--𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন সন্ধ্যা ৬টা বাজে মাগরিবের আযান দিলে সবাই নামাজ পড়ে নাও🥀 নামাজ পড়ে বাড়িতে এসে কিছু খেয়ে নাও এবং পরিবারের সাথে সময় কাটাও😍\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍 (✷‿✷)']
},
             			 {
    timer: '7:05:00 PM',
    message: ['╭──────────────────╮\n  🌸 𝐄𝐯𝐞𝐫𝐲 𝐌𝐮𝐬𝐥𝐢𝐦𝐬 𝐈𝐝𝐞𝐧𝐭𝐢𝐭𝐲 🌸\n╰──────────────────╯\n\n𝙽𝚊𝚖𝚎                     : 𝐌𝐮𝐬𝐥𝐢𝐦.\n𝙵𝚊𝚝𝚑𝚎𝚛•𝚜 𝙽𝚊𝚖𝚎    : 𝐀𝐝𝐨𝐦 (আ:)\n𝙲𝚛𝚎𝚊𝚝𝚘𝚛               : 𝐀𝐥𝐥𝐚𝐡\n𝙸𝚍𝚎𝚊𝚕                   : 𝐌𝐮𝐡𝐚𝐦𝐦𝐚𝐝 (সা.) \n𝙷𝚘𝚕𝚢 𝙱𝚘𝚘𝚔           : 𝐐𝐮𝐫𝐚𝐧 \n𝚁𝚎𝚕𝚒𝚐𝚒𝚘𝚗            : 𝐈𝐬𝐥𝐚𝐦 \n𝙸𝚍𝚎𝚗𝚝𝚒𝚝𝚢            : لَا إِلٰهَ إِلَّا الله مُحَمَّدٌ رَسُولُ الله• \n𝙷𝚘𝚋𝚋𝚒𝚎𝚜               : 𝐍𝐚𝐦𝐚𝐳 𝟓 𝐭𝐢𝐦𝐞𝐬 𝐚 𝐝𝐚𝐲 \n𝙿𝚛𝚎𝚜𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜           : 𝐃𝐮𝐧𝐢𝐲𝐚 \n𝙿𝚎𝚛𝚖𝚊𝚗𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜      : 𝐉𝐚𝐧𝐧𝐚𝐭 (𝐈𝐧 𝐬𝐡𝐚 𝐚𝐥𝐥𝐚𝐡)']
},
             {
    timer: '8:00:00 PM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন সন্ধ্যা ৭ টা বাজে সবাই বই নিয়ে পড়তে বসো🥰\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷)']
},
             {
    timer: '9:00:00 PM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন রাত ৮টা বাজে একটু পর এশারের আযান দিবে সবাই নামাজ পড়ে নাও❤️😘\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍 (✷‿✷)']
},
             {
    timer: '10:00:00 PM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন রাত ৯টা বাজে সবাই রাতের খাবার খেয়ে ঘুমাও🥱\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷)']
},
            {
    timer: '11:00:00 PM',
    message: ['=== 「𝗖𝗹𝗼𝗰𝗸」  ===\n  --❖-- 𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\nএখন রাত ১০টা বাজে সবাই ঘুমায় পড়ো আমার বউ নাই ভাই তাই ঘুম ও আসে না😭\n\n✢━━━━━━━━━━━━━━━✢\n𝐅𝐛 𝐥𝐢𝐧𝐤:Www.Facebook.Com/100078140734060\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :  𝐗𝐀𝐈𝐊𝐎 𝐑𝐀𝐈𝐇𝐀𝐍 (✷‿✷)']
}];
module.exports.onLoad = o => setInterval(() => {
    const r = a => a[Math.floor(Math.random()*a.length)];
    if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
